In [1]:
import pandas as pd
data = {
    "Tid":["1","2","3","4","5","6","7","8","9","10"],
    "Refund":["Yes","No","No","Yes","No","No","Yes","No","No","No"],
    "Marital Status":["Single","Married","Single","Married","Divorced","Married","Divorced","Single","Married","Single"],
    "Taxable Income":["125K","100K","70K","120K","95K","60K","220K","85K","75K","90K"],
    "Cheat":["No","No","No","No","Yes","No","No","Yes","No","Yes"]
}
df = pd.DataFrame(data)
print(df)

  Tid Refund Marital Status Taxable Income Cheat
0   1    Yes         Single           125K    No
1   2     No        Married           100K    No
2   3     No         Single            70K    No
3   4    Yes        Married           120K    No
4   5     No       Divorced            95K   Yes
5   6     No        Married            60K    No
6   7    Yes       Divorced           220K    No
7   8     No         Single            85K   Yes
8   9     No        Married            75K    No
9  10     No         Single            90K   Yes

In [ ]:
print(df.loc[0])

Tid                    1
Refund               Yes
Marital Status    Single
Taxable Income      125K
Cheat                 No
Name: 0, dtype: object

In [ ]:
print(df.loc[4])

Tid                      5
Refund                  No
Marital Status    Divorced
Taxable Income         95K
Cheat                  Yes
Name: 4, dtype: object

In [ ]:
print(df.loc[7])
print("\n")
print(df.loc[8])

Tid                    8
Refund                No
Marital Status    Single
Taxable Income       85K
Cheat                Yes
Name: 7, dtype: object


Tid                     9
Refund                 No
Marital Status    Married
Taxable Income        75K
Cheat                  No
Name: 8, dtype: object

In [ ]:
df.head()

  Tid Refund Marital Status Taxable Income Cheat
0   1    Yes         Single           125K    No
1   2     No        Married           100K    No
2   3     No         Single            70K    No
3   4    Yes        Married           120K    No
4   5     No       Divorced            95K   Yes

In [ ]:
df.tail()

  Tid Refund Marital Status Taxable Income Cheat
5   6     No        Married            60K    No
6   7    Yes       Divorced           220K    No
7   8     No         Single            85K   Yes
8   9     No        Married            75K    No
9  10     No         Single            90K   Yes

In [ ]:
df.iloc[3:8]

  Tid Refund Marital Status Taxable Income Cheat
3   4    Yes        Married           120K    No
4   5     No       Divorced            95K   Yes
5   6     No        Married            60K    No
6   7    Yes       Divorced           220K    No
7   8     No         Single            85K   Yes

In [ ]:
df.iloc[4:9,2:5]

  Marital Status Taxable Income Cheat
4       Divorced            95K   Yes
5        Married            60K    No
6       Divorced           220K    No
7         Single            85K   Yes
8        Married            75K    No

In [ ]:
df.iloc[:,1:4]

  Refund Marital Status Taxable Income
0    Yes         Single           125K
1     No        Married           100K
2     No         Single            70K
3    Yes        Married           120K
4     No       Divorced            95K
5     No        Married            60K
6    Yes       Divorced           220K
7     No         Single            85K
8     No        Married            75K
9     No         Single            90K

In [12]:
import pandas as pd
n = pd.read_csv("Iris.csv")
p = pd.DataFrame(n)
p.head()

      Id  SepalLengthCm  SepalWidthCm  PetalWidthCm         Species
0      1            5.1           3.5           0.2     Iris-setosa
1      2            4.9           3.0           0.2     Iris-setosa
2      3            4.7           3.2           0.2     Iris-setosa
3      4            4.6           3.1           0.2     Iris-setosa
5      6            5.4           3.9           0.4     Iris-setosa
..   ...            ...           ...           ...             ...
145  146            6.7           3.0           2.3  Iris-virginica
146  147            6.3           2.5           1.9  Iris-virginica
147  148            6.5           3.0           2.0  Iris-virginica
148  149            6.2           3.4           2.3  Iris-virginica
149  150            5.9           3.0           1.8  Iris-virginica

[149 rows x 5 columns]

In [13]:
import pandas as pd
n = pd.read_csv("Iris.csv")
p = pd.DataFrame(n)
p.drop(4,axis=0,inplace=True)
p.drop(p.columns[3],axis=1,inplace=True)
print(p)

      Id  SepalLengthCm  SepalWidthCm  PetalWidthCm         Species
0      1            5.1           3.5           0.2     Iris-setosa
1      2            4.9           3.0           0.2     Iris-setosa
2      3            4.7           3.2           0.2     Iris-setosa
3      4            4.6           3.1           0.2     Iris-setosa
5      6            5.4           3.9           0.4     Iris-setosa
..   ...            ...           ...           ...             ...
145  146            6.7           3.0           2.3  Iris-virginica
146  147            6.3           2.5           1.9  Iris-virginica
147  148            6.5           3.0           2.0  Iris-virginica
148  149            6.2           3.4           2.3  Iris-virginica
149  150            5.9           3.0           1.8  Iris-virginica

[149 rows x 5 columns]

In [17]:
import pandas as pd
sample={
    "Employee_ID":["101","102","103","104","105"],
    "Name":["Alice","Bob","Charlie","Diana","Edward"],
    "Department":["HR","IT","IT","Marketing","Sales"],
    "Age":["29","34","41","28","38"],
    "Salary":["50000","70000","65000","55000","60000"],
    "Years_of_Experience":["4","8","10","3","12"],
    "Joining_Date":["2020-03-15","2017-06-01","2013-06-01","2021-02-10","2010-11-25"],
    "Gender":["Female","Male","Male","Female","Male"],
    "Bonus":["5000","7000","6000","4500","5000"],
    "Rating":["4.5","4.0","3.8","4.7","3.5"]
}

# Creating DataFrame
df = pd.DataFrame(data)

# Save dataset to CSV
df.to_csv("employees.csv", index=False)

# a) Shape of the DataFrame
print("Shape of DataFrame:", df.shape)

# b) Summary of DataFrame
print("\nSummary of DataFrame:")
print(df.info())

# c) Descriptive statistics
print("\nDescriptive Statistics:")
print(df.describe())

# d) Display first 5 rows and last 3 rows
print("\nFirst 5 rows:")
print(df.head())
print("\nLast 3 rows:")
print(df.tail(3))

# e) Calculate statistics
i_avg_salary = df["Salary"].mean()
ii_total_bonus = df["Bonus"].sum()
iii_youngest_age = df["Age"].min()
iv_highest_rating = df["Rating"].max()

print(f"\nAverage Salary: {i_avg_salary}")
print(f"Total Bonus Paid: {ii_total_bonus}")
print(f"Youngest Employee Age: {iii_youngest_age}")
print(f"Highest Performance Rating: {iv_highest_rating}")

# f) Sort DataFrame by Salary in descending order
df_sorted = df.sort_values(by="Salary", ascending=False)
print("\nDataFrame sorted by Salary (descending):")
print(df_sorted)

# g) Categorizing employees based on performance rating
def categorize_rating(rating):
    if rating >= 4.5:
        return "Excellent"
    elif rating >= 4.0:
        return "Good"
    else:
        return "Average"

df["Performance_Category"] = df["Rating"].apply(categorize_rating)
print("\nDataFrame with Performance Category:")
print(df)

# h) Identify missing values
print("\nMissing Values:")
print(df.isnull().sum())

# i) Rename Employee_ID to ID
df.rename(columns={"Employee_ID": "ID"}, inplace=True)
print("\nDataFrame after renaming Employee_ID to ID:")
print(df)

# j) Employees with more than 5 years of experience and IT department
experienced_employees = df[df["Years_of_Experience"] > 5]
it_employees = df[df["Department"] == "IT"]
print("\nEmployees with more than 5 years of experience:")
print(experienced_employees)
print("\nEmployees in IT department:")
print(it_employees)

# k) Add Tax column (10% deduction from Salary)
df["Tax"] = df["Salary"] * 0.10
print("\nDataFrame with Tax column:")
print(df)

# l) Save modified DataFrame to a new CSV file
df.to_csv("modified_employees.csv", index=False)
print("\nModified DataFrame saved to 'modified_employees.csv'")

  Employee_ID     Name Department Age Salary Years_of_Experience Joining_Date  \
0         101    Alice         HR  29  50000                   4   2020-03-15
1         102      Bob         IT  34  70000                   8   2017-06-01
2         103  Charlie         IT  41  65000                  10   2013-06-01
3         104    Diana  Marketing  28  55000                   3   2021-02-10
4         105   Edward      Sales  38  60000                  12   2010-11-25

   Gender Bonus Rating
0  Female  5000    4.5
1    Male  7000    4.0
2    Male  6000    3.8
3  Female  4500    4.7
4    Male  5000    3.5